"""
Раунд плей-офф между двумя командами состоит из двух матчей. Каждая команда проводит по одному матчу «дома»
и «в гостях». Выигрывает команда, забившая большее число мячей. Если же число забитых мячей совпадает, выигрывает
команда, забившая больше мячей «в гостях». Если и это число мячей совпадает, матч переходит в дополнительный
тайм или серию пенальти.

Вам дан счёт первого матча, а также счёт текущей игры (которая ещё не завершилась). Помогите комментатору сообщить,
сколько голов необходимо забить первой команде, чтобы победить, не переводя игру в дополнительное время.

Формат ввода
В первой строке записан счёт первого мачта в формате G1:G2, где G1 — число мячей, забитых первой командой,
а G2 — число мячей, забитых второй командой.
Во второй строке записан счёт второго (текущего) матча в аналогичном формате. Все числа в записи счёта не превышают 5.
В третьей строке записано число 1, если первую игру первая команда провела «дома», или 2, если «в гостях».

Формат вывода
Выведите единственное целое число "— необходимое количество мячей.

Пример 1
0:0
0:0
1

1

Пример 2
0:2
0:3
1

5

Пример 3
0:2
0:3
2

6
"""

print('---------answer----------')

G1, G2 = map(int, input().split(':'))
F1, F2 = map(int, input().split(':'))
HOME_GUESTS = int(input())

X = None
a = None

if (G1 + F1) > (G2 + F2):
    X = 0
else:
    a = (G2 + F2) - (G1 + F1)
    if HOME_GUESTS == 1:
        if (F1 + a) > G2:
            X = a
        else:
            X = a + 1
    if HOME_GUESTS == 2:
        if G1 > F2:
            X = a
        else:
            X = a + 1

print(X)

print('---------yandex----------')

g11, g21 = map(int, input().split(':'))
g12, g22 = map(int, input().split(':'))
where = int(input())

if where == 1:
    score1 = g11 * 100 + g12 * 101
    score2 = g21 * 101 + g22 * 10
    print(max(0, (score2 - score1 + 101) // 101))
else:
    score1 = g11 * 101 + g12 * 100
    score2 = g21 * 100 + g22 * 101
    print(max(0, score2 - score1 + 100) // 100)
