"""
На столе лежали две одинаковые верёвочки целой положительной длины.
Петя разрезал одну из верёвочек на N частей, каждая из которых имеет целую положительную длину,
так что на столе стало N+1 верёвочек. Затем в комнату зашла Маша и взяла одну из лежащих на столе верёвочек.
По длинам оставшихся на столе N верёвочек определите, какую наименьшую длину может иметь верёвочка, взятая Машей.

Формат ввода
Первая строка входных данных содержит одно целое число N — количество верёвочек, оставшихся на столе (2 ≤ N ≤ 1000).
Во второй строке содержится N целых чисел li — длины верёвочек (1 ≤ li ≤ 1000).

Формат вывода
Выведите одно целое число — наименьшую длину, которую может иметь верёвочка, взятая Машей.

Пример 1
4
1 5 2 1

1

Пример 2
4
5 12 4 3

24
"""

print('---------answer----------')

n = int(input())
ropes = list(map(int, input().split()))

sum_ropes = 0
max_rope = 0

for i in ropes:
    sum_ropes += i
    if i > max_rope:
        max_rope = i

sum_ropes_total = sum_ropes - max_rope

if max_rope > sum_ropes_total:
    print(max_rope - sum_ropes_total)
else:
    print(sum_ropes)

print('---------yandex----------')

n = int(input())
a = list(map(int, input().split()))
suma = sum(a)
maxa = max(a)
if maxa * 2 > suma:
    print(maxa * 2 - suma)
else:
    print(suma)
