"""
Поле в игре в одномерный морской бой имеет размеры 1×n. Ваша задача — найти такое максимальное
k, что на поле можно расставить один корабль размера 1×k, два корабля размера 1×(k−1),…,k кораблей размера
1×1, причем корабли, как и в обычном морском бое, не должны касаться друг друга и пересекаться.

Формат ввода
В единственной строке входных данных дано число n — количество клеток поля

Формат вывода
Выведите единственное число — такое максимальное k, что можно расставить корабли, как описано в условии.

Пример
7

2
"""

print('---------answer----------')


def check(k):
    x = k * k * (k + 1) // 2 - k * (k + 1) * (2 * k + 1) // 6 + k * (k + 1)
    return x <= n + 1


n = int(input())
l = 0
r = n + 1

while r - l > 1:
    m = (l + r) // 2
    if check(m):
        l = m
    else:
        r = m

print(l)

print('---------yandex----------')


def shipslen(k):
    cntspaces = max((1 + k) * k // 2 - 1, 0)
    sumofkbigships = (k + k ** 2) * k // 2
    sumofexcess = k * (k + 1) * (2 * k + 1) // 6 - (1 + k) * k // 2
    return cntspaces + sumofkbigships - sumofexcess


n = int(input())
l = 0
r = n + 1
while l < r:
    m = (l + r + 1) // 2
    k = shipslen(m)
    if shipslen(m) <= n:
        l = m
    else:
        r = m - 1
print(l)
