"""
Как известно, Саруман Радужный очень любит порядок. Поэтому все полки его войска стоят друг за другом,
причем каждый следующий полк содержит количество орков не меньше, чем предыдущий.

Перед тем как напасть на Хельмову Падь, Саруман решил провести несколько вылазок для разведки. Чтобы
его отряды никто не заметил, он решил каждый раз отправлять несколько подряд идущих полков так, чтобы суммарное
количество орков в них было равно определенному числу. Так как это всего лишь разведка, каждый полк после вылазки
возвращается на свое место. Задачу выбрать нужные полки он поручил Гриме Змеиному Языку. А Грима не поскупится
на вознаграждение, если вы ему поможете.

Формат ввода
В первой строке входного файла находится два целых числа: n  — количество полков и m – количество предстоящих вылазок.
В следующей строке записано n чисел ai, где ai — число орков в i-ом полке.

Далее в m строках записаны запросы вида: количество полков l, которые должны будут отправиться в эту вылазку,
и суммарное количество орков в этих полках s

Формат вывода
Для каждого запроса выведите номер полка, с которого начнутся те l, которые необходимо отправить на вылазку.
Если таких полков несколько, выведите любой. Если же так выбрать полки нельзя, выведите -1.
"""

print('---------answer----------')

from itertools import accumulate

n, m = map(int, input().split())
a = list(map(int, input().split()))
summa = list(accumulate([0] + a))

for _ in range(m):
    leng, s = map(int, input().split())

    l = 0
    r = n - leng + 1
    while l < r - 1:
        mid = (l + r) // 2
        if summa[mid + leng] - summa[mid] > s:
            r = mid
        else:
            l = mid

    if summa[l + leng] - summa[l] == s:
        print(l + 1)
    else:
        print(-1)

print('------yandex------')

n, q = map(int, input().split())
a = [0] + list(map(int, input().split()))

prefsum = [0] * (n + 1)
for i in range(1, n + 1):
    prefsum[i] = prefsum[i - 1] + a[i]
ans = []
for i in range(q):
    orccnt, orcsum = map(int, input().split())
    l = 1
    r = n + 1 - orccnt
    while l < r:
        m = (l + r) // 2
        if prefsum[m + orccnt - 1] - prefsum[m - 1] >= orcsum:
            r = m
        else:
            l = m + 1
    if prefsum[l + orccnt - 1] - prefsum[l - 1] == orcsum:
        ans.append(l)
    else:
        ans.append(-1)
print(*ans)
